zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4eXc-pinctrl.h
/* pc28_gpio */
#define PC28_GPIO \
	SAM_PINMUX(c, 28, gpio, gpio)

/* pc28b_tc1_tclk4 */
#define PC28B_TC1_TCLK4 \
	SAM_PINMUX(c, 28, b, periph)

/* pc29_gpio */
#define PC29_GPIO \
	SAM_PINMUX(c, 29, gpio, gpio)

/* pc29b_tc1_tioa5 */
#define PC29B_TC1_TIOA5 \
	SAM_PINMUX(c, 29, b, periph)

/* pc29x_afec0_ad9 */
#define PC29X_AFEC0_AD9 \
	SAM_PINMUX(c, 29, x, extra)

/* pc30_gpio */
#define PC30_GPIO \
	SAM_PINMUX(c, 30, gpio, gpio)

/* pc30b_tc1_tiob5 */
#define PC30B_TC1_TIOB5 \
	SAM_PINMUX(c, 30, b, periph)

/* pc30x_afec0_ad10 */
#define PC30X_AFEC0_AD10 \
	SAM_PINMUX(c, 30, x, extra)

/* pc31_gpio */
#define PC31_GPIO \
	SAM_PINMUX(c, 31, gpio, gpio)

/* pc31b_tc1_tclk5 */
#define PC31B_TC1_TCLK5 \
	SAM_PINMUX(c, 31, b, periph)

/* pc31x_afec0_ad11 */
#define PC31X_AFEC0_AD11 \
	SAM_PINMUX(c, 31, x, extra)

/* pd0_gpio */
#define PD0_GPIO \
	SAM_PINMUX(d, 0, gpio, gpio)

/* pd0a_gmac_gtxck */
#define PD0A_GMAC_GTXCK \
	SAM_PINMUX(d, 0, a, periph)

/* pd1_gpio */
#define PD1_GPIO \
	SAM_PINMUX(d, 1, gpio, gpio)

/* pd1a_gmac_gtxen */
#define PD1A_GMAC_GTXEN \
	SAM_PINMUX(d, 1, a, periph)

/* pd2_gpio */
#define PD2_GPIO \
	SAM_PINMUX(d, 2, gpio, gpio)

/* pd2a_gmac_gtx0 */
#define PD2A_GMAC_GTX0 \
	SAM_PINMUX(d, 2, a, periph)

/* pd3_gpio */
#define PD3_GPIO \
	SAM_PINMUX(d, 3, gpio, gpio)

/* pd3a_gmac_gtx1 */
#define PD3A_GMAC_GTX1 \
	SAM_PINMUX(d, 3, a, periph)

/* pd4_gpio */
#define PD4_GPIO \
	SAM_PINMUX(d, 4, gpio, gpio)

/* pd4a_gmac_grxdv */
#define PD4A_GMAC_GRXDV \
	SAM_PINMUX(d, 4, a, periph)

/* pd5_gpio */
#define PD5_GPIO \
	SAM_PINMUX(d, 5, gpio, gpio)

/* pd5a_gmac_grx0 */
#define PD5A_GMAC_GRX0 \
	SAM_PINMUX(d, 5, a, periph)

/* pd6_gpio */
#define PD6_GPIO \
	SAM_PINMUX(d, 6, gpio, gpio)

/* pd6a_gmac_grx1 */
#define PD6A_GMAC_GRX1 \
	SAM_PINMUX(d, 6, a, periph)

/* pd7_gpio */
#define PD7_GPIO \
	SAM_PINMUX(d, 7, gpio, gpio)

/* pd7a_gmac_grxer */
#define PD7A_GMAC_GRXER \
	SAM_PINMUX(d, 7, a, periph)

/* pd8_gpio */
#define PD8_GPIO \
	SAM_PINMUX(d, 8, gpio, gpio)

/* pd8a_gmac_gmdc */
#define PD8A_GMAC_GMDC \
	SAM_PINMUX(d, 8, a, periph)

/* pd9_gpio */
#define PD9_GPIO \
	SAM_PINMUX(d, 9, gpio, gpio)

/* pd9a_gmac_gmdio */
#define PD9A_GMAC_GMDIO \
	SAM_PINMUX(d, 9, a, periph)

/* pd10_gpio */
#define PD10_GPIO \
	SAM_PINMUX(d, 10, gpio, gpio)

/* pd10a_gmac_gcrs */
#define PD10A_GMAC_GCRS \
	SAM_PINMUX(d, 10, a, periph)

/* pd11_gpio */
#define PD11_GPIO \
	SAM_PINMUX(d, 11, gpio, gpio)

/* pd11a_gmac_grx2 */
#define PD11A_GMAC_GRX2 \
	SAM_PINMUX(d, 11, a, periph)

/* pd12_gpio */
#define PD12_GPIO \
	SAM_PINMUX(d, 12, gpio, gpio)

/* pd12a_gmac_grx3 */
#define PD12A_GMAC_GRX3 \
	SAM_PINMUX(d, 12, a, periph)

/* pd13_gpio */
#define PD13_GPIO \
	SAM_PINMUX(d, 13, gpio, gpio)

/* pd13a_gmac_gcol */
#define PD13A_GMAC_GCOL \
	SAM_PINMUX(d, 13, a, periph)

/* pd14_gpio */
#define PD14_GPIO \
	SAM_PINMUX(d, 14, gpio, gpio)

/* pd14a_gmac_grxck */
#define PD14A_GMAC_GRXCK \
	SAM_PINMUX(d, 14, a, periph)

/* pd15_gpio */
#define PD15_GPIO \
	SAM_PINMUX(d, 15, gpio, gpio)

/* pd15a_gmac_gtx2 */
#define PD15A_GMAC_GTX2 \
	SAM_PINMUX(d, 15, a, periph)

/* pd16_gpio */
#define PD16_GPIO \
	SAM_PINMUX(d, 16, gpio, gpio)

/* pd16a_gmac_gtx3 */
#define PD16A_GMAC_GTX3 \
	SAM_PINMUX(d, 16, a, periph)

/* pd17_gpio */
#define PD17_GPIO \
	SAM_PINMUX(d, 17, gpio, gpio)

/* pd17a_gmac_gtxer */
#define PD17A_GMAC_GTXER \
	SAM_PINMUX(d, 17, a, periph)

/* pd18_gpio */
#define PD18_GPIO \
	SAM_PINMUX(d, 18, gpio, gpio)

/* pd19_gpio */
#define PD19_GPIO \
	SAM_PINMUX(d, 19, gpio, gpio)

/* pd20_gpio */
#define PD20_GPIO \
	SAM_PINMUX(d, 20, gpio, gpio)

/* pd20a_pwm_pwmh0 */
#define PD20A_PWM_PWMH0 \
	SAM_PINMUX(d, 20, a, periph)

/* pd21_gpio */
#define PD21_GPIO \
	SAM_PINMUX(d, 21, gpio, gpio)

/* pd21a_pwm_pwmh1 */
#define PD21A_PWM_PWMH1 \
	SAM_PINMUX(d, 21, a, periph)

/* pd22_gpio */
#define PD22_GPIO \
	SAM_PINMUX(d, 22, gpio, gpio)

/* pd22a_pwm_pwmh2 */
#define PD22A_PWM_PWMH2 \
	SAM_PINMUX(d, 22, a, periph)

/* pd23_gpio */
#define PD23_GPIO \
	SAM_PINMUX(d, 23, gpio, gpio)

/* pd23a_pwm_pwmh3 */
#define PD23A_PWM_PWMH3 \
	SAM_PINMUX(d, 23, a, periph)

/* pd24_gpio */
#define PD24_GPIO \
	SAM_PINMUX(d, 24, gpio, gpio)

/* pd24a_pwm_pwml0 */
#define PD24A_PWM_PWML0 \
	SAM_PINMUX(d, 24, a, periph)

/* pd25_gpio */
#define PD25_GPIO \
	SAM_PINMUX(d, 25, gpio, gpio)

/* pd25a_pwm_pwml1 */
#define PD25A_PWM_PWML1 \
	SAM_PINMUX(d, 25, a, periph)

/* pd26_gpio */
#define PD26_GPIO \
	SAM_PINMUX(d, 26, gpio, gpio)

/* pd26a_pwm_pwml2 */
#define PD26A_PWM_PWML2 \
	SAM_PINMUX(d, 26, a, periph)

/* pd27_gpio */
#define PD27_GPIO \
	SAM_PINMUX(d, 27, gpio, gpio)

/* pd27a_pwm_pwml3 */
#define PD27A_PWM_PWML3 \
	SAM_PINMUX(d, 27, a, periph)

/* pd28_gpio */
#define PD28_GPIO \
	SAM_PINMUX(d, 28, gpio, gpio)

/* pd29_gpio */
#define PD29_GPIO \
	SAM_PINMUX(d, 29, gpio, gpio)

/* pd30_gpio */
#define PD30_GPIO \
	SAM_PINMUX(d, 30, gpio, gpio)

/* pd31_gpio */
#define PD31_GPIO \
	SAM_PINMUX(d, 31, gpio, gpio)
